---
type: InitialIlluminanceIntensity
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# InitialIlluminanceIntensity

`Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InitialIlluminanceIntensity | — | `` |
| Property | Distance | 2013 | `public double Distance { get ; set ; }` |
| Property | Illuminance | 2013 | `public double Illuminance { get ; set ; }` |